# 数据表
    window.kodoData =
      'east':
        '0': 0
        '10': 0.148
        '1024': 0.145
        '204800': 0.142
        '5242880': 0.139
      'sourth':
        '0': 0
        '10': 0.134
        '1024': 0.131
        '204800': 0.128
        '5242880': 0.125
      'north':
        '0': 0
        '10': 0.148
        '1024': 0.145
        '204800': 0.142
        '5242880': 0.139
      'northAmerica':
        '0': 0
        '10': 0.165
        '1024': 0.162
        '204800': 0.159
        '5242880': 0.156
      'writes':
        '0': 0
        '10': 0.01
      'reads':
        '0': 0
        '100': 0.01
    window.lowKodoData =
      'space': 0.06
      'APIs': 0.1
      'types': 0.1
      'HTTPs':
        '0': 0
        '10': 0.29
        '102400': 0.26
    window.fusionData =
      'inland':
        'HTTPs':
          '0': 0
          '10': 0.29
          '102400': 0.26
        'HTTPSs':
          '0': 0.36
          '10240': 0.32
          '102400': 0.26
      'outland':
        'HTTPs':
          '0':
            'ENA': 0.39
            'Asia': 0.57
            'India': 0.87
            'SA': 0.87
            'Oceania': 1.08
          '10':
            'ENA': 0.34
            'Asia': 0.50
            'India': 0.76
            'SA': 0.76
            'Oceania': 0.94
          '102400':
            'ENA': 0.30
            'Asia': 0.44
            'India': 0.66
            'SA': 0.66
            'Oceania': 0.82
          '1048576':
            'ENA': 0.26
            'Asia': 0.38
            'India': 0.57
            'SA': 0.57
            'Oceania': 0.71
          '10PB以上': '联系我们'
        'HTTPSs':
          '0':
            'ENA': 0.46
            'Asia': 0.68
            'India': 1.04
            'SA': 1.04
            'Oceania': 1.29
          '10':
            'ENA': 0.4
            'Asia': 0.60
            'India': 0.91
            'SA': 0.91
            'Oceania': 1.12
          '102400':
            'ENA': 0.36
            'Asia': 0.52
            'India': 0.79
            'SA': 0.79
            'Oceania': 0.98
          '1048576':
            'ENA': 0.31
            'Asia': 0.45
            'India': 0.68
            'SA': 0.68
            'Oceania': 0.85
          '10PB以上': '联系我们'