import React from 'react'

import animation from '../../animation.less'

// 开放应用市场
export default function OpenAppMarketIcon() {
  return (
    <svg>
      <polygon fill="#C2E7FF" points="0 32.857 60 68.498 120 32.857 60 0" transform="translate(0 38)"></polygon>
      <g className={animation.levitate3}>
        <g transform="translate(18 42)">
          <polygon fill="#006EBB" points="0 23 42 23 42 55 0 29.2"></polygon>
          <polygon fill="#34A1EC" points="42 23 84 23 84 55 42 29.2" transform="matrix(-1 0 0 1 126 0)"></polygon>
          <polygon fill="#5EBDFF" points="0 23 42 47.949 84 23 42 0"></polygon>
        </g>
      </g>
      <g className={animation.levitate2}>
        <g transform="translate(18 26)">
          <polygon fill="#006EBB" points="0 23 42 23 42 55 0 29.2"></polygon>
          <polygon fill="#34A1EC" points="42 23 84 23 84 55 42 29.2" transform="matrix(-1 0 0 1 126 0)"></polygon>
          <polygon fill="#5EBDFF" points="0 23 42 47.949 84 23 42 0"></polygon>
        </g>
      </g>
      <g className={animation.levitate1}>
        <g transform="translate(18 10)">
          <polygon fill="#006EBB" points="0 23 42 23 42 55 0 29.2"></polygon>
          <polygon fill="#34A1EC" points="42 23 84 23 84 55 42 29.2" transform="matrix(-1 0 0 1 126 0)"></polygon>
          <polygon fill="#98D5FF" points="0 23 42 47.949 84 23 42 0"></polygon>
          <path d="M41,26 C45.418278,26 49,28.0147186 49,30.5 C49,32.9852814 45.418278,35 41,35 C36.581722,35 33,32.9852814 33,30.5 C33,28.0147186 36.581722,26 41,26 Z M54.5,19 C58.6421356,19 62,21.0147186 62,23.5 C62,25.9852814 58.6421356,28 54.5,28 C50.3578644,28 47,25.9852814 47,23.5 C47,21.0147186 50.3578644,19 54.5,19 Z M29,18 C33.418278,18 37,20.0147186 37,22.5 C37,24.9852814 33.418278,27 29,27 C24.581722,27 21,24.9852814 21,22.5 C21,20.0147186 24.581722,18 29,18 Z M42.5,12 C46.6421356,12 50,13.790861 50,16 C50,18.209139 46.6421356,20 42.5,20 C38.3578644,20 35,18.209139 35,16 C35,13.790861 38.3578644,12 42.5,12 Z" fill="#319EEA"></path>
          <path d="M41,26 C45.418278,26 49,28.0147186 49,30.5 C49,32.9852814 45.418278,35 41,35 C36.581722,35 33,32.9852814 33,30.5 C33,28.0147186 36.581722,26 41,26 Z M54.5,19 C58.6421356,19 62,21.0147186 62,23.5 C62,25.9852814 58.6421356,28 54.5,28 C50.3578644,28 47,25.9852814 47,23.5 C47,21.0147186 50.3578644,19 54.5,19 Z M29,18 C33.418278,18 37,20.0147186 37,22.5 C37,24.9852814 33.418278,27 29,27 C24.581722,27 21,24.9852814 21,22.5 C21,20.0147186 24.581722,18 29,18 Z M42.5,12 C46.6421356,12 50,13.790861 50,16 C50,18.209139 46.6421356,20 42.5,20 C38.3578644,20 35,18.209139 35,16 C35,13.790861 38.3578644,12 42.5,12 Z" fill="#000" filter="url(#机器数据模块-g)"></path>
        </g>
      </g>
    </svg>
  )
}
